[
  {
    "id": 3,
    "slug": "joggr",
    "published": true,
    "customer": {
      "name": "Joggr",
      "logo_url": "https://www.joggr.ai/images/joggr-guy.png",
      "website": "https://www.linkedin.com/company/joggr/",
      "industry": "Developer Tooling / Documentation"
    },
    "case_study": {
      "title": "How Joggr Built Documentation Agents with VoltAgent + VoltOps",
      "use_case": "AI-first documentation assistant that automatically generates, updates, and syncs Markdown docs",
      "challenge": [
        "Joggr needed a TypeScript-native framework but found everything in the LLM ecosystem was Python-first",
        "The team was managing a tangle of custom tooling built on top of Vercel's AI libraries",
        "Debugging flows and understanding what the agents were doing was painful and hard to scale",
        "They needed to offload memory and orchestration management from their custom solution"
      ],
      "challenge_paragraph": "Joggr is building an AI-first documentation assistant that keeps developer docs up to date, automatically generating, updating, and syncing Markdown docs every time your code changes. But early on, Zac and the team faced a challenge: \"Everything in the LLM ecosystem is Python-first. We're a TypeScript shop. We needed a framework that spoke our language and helped us offload memory and orchestration.\" On top of that, they were managing a tangle of custom tooling built on top of Vercel's AI libraries. Debugging flows and understanding what the agents were doing was painful and hard to scale.",
      "solution": [
        "Joggr adopted VoltAgent as a flexible, TypeScript-native AI agent framework",
        "They paired it with VoltOps, VoltAgent's visual observability console for complete visibility",
        "Built agents that generate and maintain dev docs in clean, composable flows",
        "Offloaded memory management with VoltAgent's built-in memory modules",
        "Gained visibility into every step of their Supervisor agent architecture using VoltOps"
      ],
      "solution_paragraph": "Zac discovered VoltAgent while searching for a flexible, TypeScript-native AI agent framework and paired it with VoltOps, VoltAgent's visual observability console. With this stack, the Joggr team was able to: Build agents that generate and maintain dev docs in clean, composable flows; Offload memory management with VoltAgent's built-in memory modules; Gain visibility into every step of their Supervisor agent architecture using VoltOps. \"Without Volt, it would almost be impossible to understand what the hell is going on and what the agents are doing.\"",
      "results": [
        "Streamlined architecture by switching from custom glue code to VoltAgent",
        "Gained complete visibility into agent operations, eliminating black boxes",
        "Improved debugging capabilities with VoltOps visual console",
        "Faster development cycles with TypeScript-native framework",
        "Enhanced confidence in deployments with full observability"
      ],
      "results_paragraph": "By switching to VoltAgent and VoltOps, Joggr streamlined their architecture, ditched custom glue code, and unlocked better visibility into how their agents operate. \"Every time we need help, the founders are there. The responsiveness is unreal.\" With a fast-moving product and an AI-first mindset, Joggr now ships with full confidence. No black boxes, no guesswork. Just dev-friendly documentation, powered by agents they can see, debug, and trust.",
      "quote": {
        "text": "Without Volt, it would almost be impossible to understand what the hell is going on and what the agents are doing. Every time we need help, the founders are there. The responsiveness is unreal.",
        "author": "Zac Rosenbauer",
        "position": "Co-founder",
        "company": "Joggr"
      },
      "links": {
        "github": "https://github.com/voltagent/voltagent",
        "discord": "https://s.voltagent.dev/discord"
      }
    }
  },
  {
    "id": 4,
    "slug": "devpotenciados",
    "published": true,
    "customer": {
      "name": "DEVPotenciados LATAM",
      "website": "https://www.linkedin.com/company/alify-ai/",
      "industry": "Developer Community / AI Education"
    },
    "case_study": {
      "title": "How DEVPotenciados LATAM Empowers Developers with AI Agents Using VoltAgent",
      "use_case": "Community platform that helps LATAM developers integrate AI into their applications and daily work",
      "challenge": [
        "Solutions like LangChain or LLM APIs directly were often quite complex for community developers",
        "Shifting from traditional software to AI agents represented a major paradigm shift",
        "The complexity of orchestrating agents prevented effective AI adoption",
        "Steep learning curve was blocking developers from building AI solutions"
      ],
      "challenge_paragraph": "Francisco leads DEVPotenciados LATAM, a community of developers in Latin America passionate about AI. The mission is to empower developers to integrate AI into their applications and daily work to enhance their potential and create truly powerful solutions. However, Francisco realized that existing solutions posed significant challenges: \"Solutions like LangChain or using LLM model APIs directly can often be quite complex. Additionally, it frequently becomes very complicated because shifting from building traditional software to creating AI agents is a major paradigm shift.\" The complexity of orchestrating agents and the steep learning curve were preventing developers in the community from effectively adopting AI solutions.",
      "solution": [
        "Francisco discovered VoltAgent as a simple and easy-to-understand framework",
        "VoltAgent provided simplified agent orchestration without traditional complexity",
        "Offered customizable tools and memory systems for the community",
        "Delivered real-time observability and monitoring through VoltOps",
        "Enhanced developer experience and productivity across the LATAM community"
      ],
      "solution_paragraph": "Francisco discovered VoltAgent while looking for a simple and easy-to-understand framework to build truly powerful AI solutions for the DEVPotenciados community. VoltAgent provided exactly what the community needed: Simplified agent orchestration without the complexity of traditional solutions; Customizable tools and memory systems; Real-time observability and monitoring through VoltOps; Developer-friendly experience that enhances productivity. \"It helps me see in real time how my agent is behaving, as well as identify which steps are failing, retry them, etc. It's very developer-friendly and enhances the development experience.\"",
      "results": [
        "Empowered LATAM developers to effectively adopt AI solutions",
        "Enabled creation of fast products with full agent visibility",
        "Made AI development accessible to more community developers",
        "Enhanced productivity and learning across the developer community",
        "Continued growth in AI solution implementation across Latin America"
      ],
      "results_paragraph": "With VoltAgent, Francisco and the DEVPotenciados LATAM community can now focus on what matters most: empowering developers across Latin America to build AI-powered solutions. The platform has enabled Francisco to create truly fast products while maintaining full visibility into agent behavior. The ease of use and monitoring capabilities have made AI development accessible to more developers in the community. \"The ease of creating truly fast products, and even the options it offers to monitor the agent.\" Francisco continues to lead the DEVPotenciados LATAM community in discovering and implementing AI solutions that enhance developer productivity and create powerful applications across the region.",
      "quote": {
        "text": "What I really like is that VoltAgent allows us to customize our own tools, our own memory, and the most amazing part is the observability and monitoring.",
        "author": "Francisco Carranza",
        "position": "Software Engineer & Community Leader",
        "company": "DEVPotenciados LATAM"
      }
    }
  },
  {
    "id": 5,
    "slug": "different",
    "published": false,
    "customer": {
      "name": "Different",
      "logo": "different",
      "website": "https://www.linkedin.com/company/different/",
      "industry": "Property Management / Real Estate"
    },
    "case_study": {
      "title": "How Different Built Reliable Property Management Agents with VoltAgent + VoltOps",
      "use_case": "Digital twin technology for homes with LLM-powered internal tools for property communications, task routing, and expert assistance",
      "challenge": [
        "Black-box behavior in tools that impact real customer operations was unacceptable",
        "Multiple tools, prompts, and logic paths made debugging complex",
        "Understanding agent decisions became a growing challenge",
        "Needed a framework that provided both structure and visibility"
      ],
      "challenge_paragraph": "Different is building a digital twin for your home, revolutionizing property management through advanced technology. As the team at Different began integrating LLMs into their internal operations such as summarizing property communications, routing tasks, and assisting their property experts they quickly ran into the classic problem: \"We couldn't afford black-box behavior in tools that impact real customer operations.\" With multiple tools, prompts, and logic paths involved, debugging and understanding agent decisions became a growing challenge. They needed a framework that gave them both structure and visibility.",
      "solution": [
        "Adopted VoltAgent to define custom agents in TypeScript",
        "Handled tool orchestration and memory in a clean, modular way",
        "Built reliable flows for tasks like support summarization and workflow triage",
        "Paired with VoltOps for real-time observability into each agent's reasoning steps",
        "Gained visibility into tool calls, memory usage, and intermediate decisions"
      ],
      "solution_paragraph": "By adopting VoltAgent, the team was able to: Define custom agents in TypeScript; Handle tool orchestration and memory in a clean, modular way; Build reliable flows for tasks like support summarization and workflow triage. They paired this with VoltOps, which gave them: Real-time observability into each agent's reasoning steps; Visibility into tool calls, memory usage, and intermediate decisions; Faster debugging when something broke or behaved unexpectedly. \"VoltOps gave us the visibility we desperately needed - we could finally see exactly what our agents were thinking and doing at every step.\"",
      "results": [
        "Runs LLM-powered internal tools with confidence",
        "Accelerated development while maintaining full control",
        "Enhanced ability to build with confidence and catch problems early",
        "Delivers smarter, faster property management experiences",
        "Achieved full visibility into AI-powered operations"
      ],
      "results_paragraph": "With VoltAgent and VoltOps, Different now runs LLM-powered internal tools with confidence, accelerating development while maintaining full control. \"Having insight into how our agents think and act has helped us build with more confidence and catch problems early.\" This lets the team at Different continue delivering smarter, faster property management experiences powered by AI, backed by full visibility.",
      "quote": {
        "text": "We couldn't afford black-box behavior in tools that impact real customer operations. Having insight into how our agents think and act has helped us build with more confidence and catch problems early.",
        "author": "Michael Klevansky",
        "position": "CEO",
        "company": "Different"
      }
    }
  },
  {
    "id": 6,
    "slug": "service-hero-marketing",
    "published": false,
    "customer": {
      "name": "Service Hero Marketing",
      "website": "https://gowithhero.com/",
      "industry": "Digital Marketing / Home Services"
    },
    "case_study": {
      "title": "How Service Hero Marketing Scaled Client Operations with AI Agents Using VoltAgent",
      "use_case": "Marketing agency automation for client onboarding, campaign optimization, and lead qualification across 450+ HVAC, plumbing, and electrical businesses",
      "challenge": [
        "Managing personalized campaigns for 450+ home service clients manually was becoming unsustainable",
        "Client onboarding processes were time-intensive and prone to human error",
        "Lead qualification and routing required constant manual intervention across multiple client accounts",
        "Scaling operations while maintaining personalized service quality was a major bottleneck"
      ],
      "challenge_paragraph": "Service Hero Marketing has built a reputation as the go-to digital marketing agency for HVAC, plumbing, and electrical businesses, serving over 450 client. But as founder Garrett and his team continued to grow, they hit a scaling wall. \"We were drowning in manual processes. Every client needed personalized campaign management, custom lead qualification, and constant optimization. Our team was working around the clock just to keep up with existing clients, let alone onboard new ones.\" The manual nature of client onboarding, campaign monitoring, and lead routing was preventing them from scaling their proven 5X ROI methodology to serve more home service businesses effectively.",
      "solution": [
        "Adopted VoltAgent to build custom agents for client onboarding automation",
        "Created intelligent campaign monitoring agents that track performance across multiple platforms",
        "Built lead qualification agents that route high-quality prospects to the right clients instantly",
        "Implemented automated reporting agents that generate personalized client insights",
        "Used VoltOps for complete visibility into all agent operations across client accounts"
      ],
      "solution_paragraph": "Garrett discovered VoltAgent while searching for a way to automate their proven processes without losing the personal touch that made Service Hero successful. With VoltAgent, the team was able to: Build custom onboarding agents that guide new HVAC, plumbing, and electrical clients through setup; Create intelligent campaign monitoring agents that track PPC, SEO, and social media performance; Develop lead qualification agents that instantly route qualified prospects to the right clients; Implement automated reporting agents that generate personalized insights for each business owner. \"VoltAgent gave us the power to scale our expertise, not just our workload. We could finally automate the repetitive tasks while keeping the strategic thinking that drives results.\"",
      "results": [
        "Reduced client onboarding time from 2 weeks to 3 days with automated workflows",
        "Improved lead qualification accuracy by 40% with consistent AI-driven processes",
        "Scaled to serve 100+ additional clients without proportional staff increases",
        "Enhanced client satisfaction with faster response times and personalized reporting",
        "Maintained their signature 5X ROI while dramatically improving operational efficiency"
      ],
      "results_paragraph": "With VoltAgent and VoltOps, Service Hero Marketing transformed from a bottlenecked agency to a scalable operation that delivers consistent results. They reduced client onboarding from 2 weeks to 3 days, improved lead qualification accuracy by 40%, and successfully scaled to serve over 100 additional home service businesses without proportional increases in manual work. \"Now we can focus on what we do best - crafting strategies that make HVAC, plumbing, and electrical businesses dominate their local markets. The agents handle the repetitive work, and we handle the growth strategies.\" Service Hero continues to help home service businesses achieve their signature 5X ROI, now powered by AI agents they can trust and monitor every step of the way.",
      "quote": {
        "text": "VoltAgent gave us the power to scale our expertise, not just our workload. We could finally automate the repetitive tasks while keeping the strategic thinking that drives results.",
        "author": "Garrett Elmore",
        "position": "Founder",
        "company": "Service Hero Marketing"
      }
    }
  },
  {
    "id": 7,
    "slug": "investor-research-team",
    "published": false,
    "customer": {
      "name": "Emre Tezisci",
      "website": "https://www.linkedin.com/in/emretezisci/",
      "industry": "Product Marketing / Investment / Tech Strategy"
    },
    "case_study": {
      "title": "How Product Marketing Expert Emre Tezisci Built a 4-Agent Investment Research Team with VoltAgent",
      "use_case": "Multi-agent research platform for private investment analysis, market intelligence, and competitive research across enterprise and startup landscapes",
      "challenge": [
        "Managing investment research across multiple markets and sectors manually was extremely time-consuming",
        "Tracking market trends and competitive intelligence for portfolio decisions required constant monitoring",
        "Coordinating research across enterprise PLG strategies and startup landscapes as an active investor was overwhelming",
        "Scaling investment analysis and product marketing insights without sacrificing depth and accuracy"
      ],
      "challenge_paragraph": "Emre Tezisci, a seasoned Product Marketing Expert and Private Investor with 7+ years navigating both corporate and startup landscapes, was facing a familiar challenge in the investment world. With a track record of achieving 5.6x MOIC and 78% IRR through diversified private investments, Emre needed sophisticated research capabilities to maintain his edge. \"As both an investor and board chair across multiple companies, I was spending countless hours researching market trends, analyzing competitive positioning, and tracking emerging opportunities. The manual research process was limiting my ability to scale quality investment decisions and strategic marketing insights.\" Traditional research tools weren't sophisticated enough to handle the complex, multi-dimensional analysis required for both investment due diligence and product marketing strategy.",
      "solution": [
        "Built a sophisticated 4-agent research system using VoltAgent with Composio MCP integration",
        "Created specialized agents for market intelligence, competitive analysis, investment research, and strategic insights",
        "Implemented a Research Supervisor Agent to orchestrate complex multi-source analysis workflows",
        "Used VoltOps for real-time visibility into research processes and decision frameworks",
        "Integrated with multiple financial and market data sources for comprehensive analysis"
      ],
      "solution_paragraph": "Leveraging his technical product marketing expertise, Emre designed and built a sophisticated multi-agent platform using VoltAgent, Composio MCP, and OpenAI GPT-4o that revolutionizes investment research and market analysis workflows. His intelligent research team includes: A market intelligence agent that monitors industry trends and emerging opportunities; A competitive analysis agent that tracks positioning across enterprise and PLG landscapes; An investment research agent that conducts due diligence and financial analysis; A strategic insights agent that synthesizes findings into actionable recommendations. \"VoltAgent allowed me to build something that operates like having a dedicated research team from Stanford and Keiretsu Forum, but with the coordination and systematic approach I needed for consistent investment success.\"",
      "results": [
        "Reduced investment research time from 15-20 hours to 2 hours per opportunity",
        "Increased research coverage by 400% across multiple sectors and geographies",
        "Enhanced due diligence quality with automated competitive and market analysis",
        "Improved investment decision speed while maintaining rigorous analysis standards",
        "Scaled from manual research to systematic intelligence gathering across portfolio companies"
      ],
      "results_paragraph": "With his 4-agent VoltAgent system, Emre transformed from a time-constrained investor doing manual research to a systematic intelligence operation that enhances both his investment decisions and product marketing strategies. He reduced research time from 15-20 hours to just 2 hours per opportunity while increasing coverage by 400%. \"Now I can focus on strategic decision-making and value creation rather than spending weeks gathering and analyzing market data. The agents handle the comprehensive research, and VoltOps gives me complete visibility into their analytical process.\" The automated competitive intelligence and market monitoring has improved both his investment thesis development and his ability to provide strategic product marketing guidance to portfolio companies. Emre's multi-agent approach has become a model for other investors and marketing executives looking to scale research-driven decision making.",
      "quote": {
        "text": "VoltAgent allowed me to build something that operates like having a dedicated research team from Stanford and Keiretsu Forum, but with the coordination and systematic approach I needed for consistent investment success.",
        "author": "Emre Tezisci",
        "position": "Product Marketing Expert & Private Investor",
        "company": "Board Chair & Founder"
      }
    }
  },
  {
    "id": 8,
    "slug": "ai-twins-singularity",
    "published": false,
    "customer": {
      "name": "Singularity",
      "website": "https://www.linkedin.com/in/robertveloso/",
      "industry": "AI Technology / Creator Economy"
    },
    "case_study": {
      "title": "How Singularity Built AI Twins for Creators Using VoltAgent",
      "use_case": "AI twin platform that helps creators engage with fans through personality-driven AI agents",
      "challenge": [
        "Building AI twins that could represent creators' personalities consistently was technically complex",
        "Managing multiple conversations simultaneously required proper orchestration",
        "Maintaining authentic voice and personality across different conversation types",
        "Scaling creator-fan interactions without losing quality or breaking character"
      ],
      "challenge_paragraph": "Robert Veloso, Co-founder and Technical Lead at Singularity, wanted to help creators engage with their growing fanbase more effectively. \"We had this idea of creating AI twins that could represent creators and chat with fans, but the technical side was more complex than we initially thought,\" explains Robert. With his background as a software engineer, Robert knew they needed more than basic chatbot technology - they needed proper memory systems, personality modeling, and conversation management that could handle multiple interactions while keeping each creator's unique voice.",
      "solution": [
        "Used VoltAgent to build AI twin agents with memory and personality features",
        "Created conversation agents that maintain each creator's specific voice patterns",
        "Built systems that handle different types of fan interactions at the same time",
        "Used VoltOps to monitor AI twin performance and conversation quality",
        "Built architecture that lets creators customize their AI twin's behavior"
      ],
      "solution_paragraph": "Robert used VoltAgent's framework to build Singularity's AI twin platform. The solution includes: AI twin agents with memory that learns from each creator; Conversation systems that keep authentic voice patterns; Multi-agent setup that handles fan questions and personal chats simultaneously; Tools that let creators adjust their AI twin's personality. \"VoltAgent gave us the foundation we needed to build something that actually works well. The memory and agent coordination features were exactly what we were looking for.\"",
      "results": [
        "Launched AI twins for creators with good fan feedback",
        "Enabled 24/7 fan engagement with quick response times",
        "Scaled to handle many conversations per creator without quality issues",
        "Helped creators engage with fans while maintaining personal connections",
        "Built a working platform for persistent AI personalities"
      ],
      "results_paragraph": "With VoltAgent, Robert and his team built a platform that works well for both creators and fans. They've launched AI twins that fans genuinely like, with 24/7 availability and fast responses. \"It's great seeing fans actually connect with these AI twins. They feel more natural than typical chatbots.\" The platform handles multiple conversations while keeping each creator's personality intact. Singularity has shown that with good AI agent architecture, creators can maintain meaningful relationships with their communities around the clock.",
      "quote": {
        "text": "VoltAgent gave us the foundation we needed to build something that actually works well. The memory and agent coordination features were exactly what we were looking for.",
        "author": "Robert Veloso",
        "position": "Co-founder & Technical Lead",
        "company": "Singularity"
      }
    }
  },
  {
    "id": 9,
    "slug": "dave-dupont-housedna",
    "published": false,
    "customer": {
      "name": "HouseDNA",
      "website": "https://www.linkedin.com/in/dave-dupont/",
      "industry": "Real Estate Technology / AI Valuations"
    },
    "case_study": {
      "title": "How Dave DuPont Built HouseDNA's AI Valuation Protocol with VoltAgent",
      "use_case": "Revolutionary HouseDNA protocol that provides real-time, accurate home valuations based on buyer preferences, distinguishing between price estimation and true valuation",
      "challenge": [
        "Traditional home valuations relied on basic comparables without considering buyer preferences",
        "Real estate agents needed better tools to provide accurate, real-time home valuations",
        "Distinguishing between simple price estimation and true valuation required complex analysis",
        "Democratizing home valuations while maintaining accuracy across different market conditions"
      ],
      "challenge_paragraph": "Dave DuPont, a Redfin Premier Agent and CFP, recognized a fundamental problem in real estate: \"Traditional home valuations were missing the human element. Price estimation and true valuation are completely different concepts, but most tools treated them the same.\" As someone passionate about empowering real estate agents with AI-driven solutions, Dave wanted to create HouseDNA - a protocol that could provide real-time, accurate home valuations based on actual buyer preferences rather than just comparable sales. The challenge was building a system that could analyze multiple data streams and buyer behavior patterns to generate truly meaningful valuations.",
      "solution": [
        "Built HouseDNA protocol using VoltAgent to process buyer preference data in real-time",
        "Created valuation agents that distinguish between price estimation and true valuation",
        "Developed buyer preference analysis agents that factor in emotional and practical preferences",
        "Built market sentiment agents that adjust valuations based on current buyer behavior",
        "Used VoltOps to monitor the entire HouseDNA valuation process for accuracy and transparency"
      ],
      "solution_paragraph": "Dave used VoltAgent to build the HouseDNA protocol that places agents at the heart of every transaction. The system includes: Buyer preference analysis agents that understand what drives real purchasing decisions; Valuation agents that separate price estimation from true market value; Real-time market sentiment agents that adjust for current buyer behavior; Transparency agents that democratize home valuation data. \"VoltAgent gave us the foundation to build something that actually understands the difference between what a home costs and what it's worth to buyers.\"",
      "results": [
        "Launched HouseDNA protocol with more accurate valuations than traditional methods",
        "Empowered real estate agents with AI-driven insights they can trust",
        "Improved transparency in the housing market through democratized valuations",
        "Scaled buyer preference analysis across different property types and markets",
        "Created a new standard for distinguishing price estimation from true valuation"
      ],
      "results_paragraph": "With VoltAgent powering HouseDNA, Dave has created a new approach to home valuations that real estate agents actually want to use. The protocol provides more accurate valuations by considering buyer preferences alongside traditional metrics. \"We're not just estimating prices - we're understanding true valuation based on what buyers actually care about. The agents handle the complex analysis, and we get insights that help agents serve their clients better.\" HouseDNA is now helping democratize home valuations and bring much-needed transparency to the housing market, with AI agents that understand the human side of real estate decisions.",
      "quote": {
        "text": "VoltAgent gave us the foundation to build something that actually understands the difference between what a home costs and what it's worth to buyers.",
        "author": "Dave DuPont",
        "position": "Creator of HouseDNA Protocol",
        "company": "Redfin Premier Agent & CFP"
      }
    }
  }
]
