{
  "total_tools": [
    {
      "id": "domain_rating",
      "name": "Domain Rating",
      "description": "Get domain rating for a domain",
      "providers": { "gumloop": { "id": "domain_rating" } },
      "mcp_content": {
        "heading": "How AI Agents Can Assess Website Authority (Domain Rating)",
        "description": "Unlock Ahrefs' Domain Rating for your AI agents using the MCP. This allows AI agents to programmatically evaluate website authority, enabling data-driven decisions for SEO strategies and competitor analysis. Integrating this via MCP gives your AI agent a clear view of domain strength."
      }
    },
    {
      "id": "backlinks_stats",
      "name": "Backlinks Statistics",
      "description": "Retrieves comprehensive backlink statistics for a specified website or url",
      "providers": {
        "gumloop": { "id": "backlinks_stats" },
        "composio": { "id": "stats_retrieval" }
      },
      "mcp_content": {
        "heading": "Retrieve Comprehensive Backlink Statistics for Your AI Agent",
        "description": "Equip your AI agents with detailed backlink statistics from Ahrefs, accessible via the MCP. AI agents can analyze referring domains, anchor texts, and link velocity, automating the discovery of link-building opportunities and assessing backlink profile health through this standardized MCP interface."
      }
    },
    {
      "id": "outlinks_stats",
      "name": "Outlinks Statistics",
      "description": "Retrieves comprehensive statistics about outgoing links (outlinks) from a specified website",
      "providers": {
        "gumloop": { "id": "outlinks_stats" },
        "composio": { "id": "outlinks_stats_composio" }
      },
      "mcp_content": {
        "heading": "Analyze Outgoing Link Health to Ensure Profile Quality",
        "description": "Leverage the MCP to allow your AI agents to scrutinize outgoing link profiles using Ahrefs data. This enables AI agents to identify potentially harmful links, understand external linking patterns, and ensure a healthy, authoritative presence, all automated via the MCP."
      }
    },
    {
      "id": "metrics",
      "name": "Comprehensive Metrics",
      "description": "Get comprehensive metrics for a domain or URL",
      "providers": { "gumloop": { "id": "metrics" } },
      "mcp_content": {
        "heading": "Utilize Comprehensive SEO Metrics for Holistic Analysis",
        "description": "Provide your AI agents with a full spectrum of Ahrefs' SEO metrics through the MCP. From organic traffic estimates to keyword positions, AI agents can access a wealth of data to perform in-depth site audits and formulate robust, AI-powered SEO campaigns."
      }
    },
    {
      "id": "domain_rating_history",
      "name": "Domain Rating History",
      "description": "Get domain rating history for a domain",
      "providers": { "gumloop": { "id": "domain_rating_history" } },
      "mcp_content": {
        "heading": "Track Domain Authority Trends Over Time",
        "description": "Enable your AI agents to monitor Domain Rating trends with Ahrefs' historical data, seamlessly integrated via the MCP. This allows AI agents to track SEO progress, assess the impact of campaigns, and understand competitor authority dynamics over time using the MCP."
      }
    },
    {
      "id": "url_rating_history",
      "name": "URL Rating History",
      "description": "Get URL rating history for a URL",
      "providers": { "gumloop": { "id": "url_rating_history" } },
      "mcp_content": {
        "heading": "Monitor URL Rating Evolution for Specific Pages",
        "description": "Through the MCP, your AI agents can access Ahrefs' URL Rating history. This empowers them to track the authority changes of specific pages, evaluate content performance, and refine SEO tactics for individual URLs based on historical data provided by the MCP."
      }
    },
    {
      "id": "refdomains_history",
      "name": "Referring Domains History",
      "description": "Get referring domains history for a domain or URL",
      "providers": { "gumloop": { "id": "refdomains_history" } },
      "mcp_content": {
        "heading": "Analyze Historical Referring Domain Changes",
        "description": "Grant your AI agents access to Ahrefs' referring domains history through the MCP. This capability allows AI agents to understand how backlink profiles have evolved, identify lost or gained referring domains, and track the long-term impact of link-building efforts, all managed by the MCP."
      }
    },
    {
      "id": "pages_history",
      "name": "Pages History",
      "description": "Get pages history for a domain or URL",
      "providers": { "gumloop": { "id": "pages_history" } },
      "mcp_content": {
        "heading": "Track Website Page Evolution and Content Changes",
        "description": "Utilize the Ahrefs MCP to enable your AI agents to analyze historical data on website pages. AI agents can monitor changes in page count, identify new or removed content, and understand how a site's structure has evolved, providing crucial context for AI-driven SEO strategies."
      }
    },
    {
      "id": "metrics_history",
      "name": "Metrics History",
      "description": "Get metrics history for a domain or URL",
      "providers": { "gumloop": { "id": "metrics_history" } },
      "mcp_content": {
        "heading": "How Your AI Agent Can Leverage Historical SEO Metrics",
        "description": "Empower your AI agents to analyze trends in key SEO metrics over time using Ahrefs data accessed through the MCP. This historical perspective allows AI agents to better understand performance trajectories and refine their strategies for optimal results."
      }
    },
    {
      "id": "keywords_history",
      "name": "Keywords History",
      "description": "Retrieves historical keyword performance data for a specified website or domain",
      "providers": {
        "gumloop": { "id": "keywords_history" },
        "composio": { "id": "site_explorer_keywords_history" }
      },
      "mcp_content": {
        "heading": "Uncover Historical Keyword Ranking Trends",
        "description": "With the Ahrefs MCP, AI agents can delve into historical keyword performance. This allows them to track ranking changes, identify emerging keyword opportunities, and understand the historical SEO footprint of a domain or URL, all accessible for your AI agent."
      }
    },
    {
      "id": "total_search_volume_history",
      "name": "Total Search Volume History",
      "description": "Get total search volume history for a domain or URL",
      "providers": { "gumloop": { "id": "total_search_volume_history" } },
      "mcp_content": {
        "heading": "Analyze Search Demand Trends and Seasonality",
        "description": "Enable your AI agents to tap into Ahrefs' total search volume history through the MCP. This feature allows AI agents to understand evolving market interest, identify seasonal trends for keywords, and make informed decisions for content creation and SEO targeting."
      }
    },
    {
      "id": "backlinks",
      "name": "Backlinks",
      "description": "Retrieves a comprehensive list of backlinks for a specified website or URL",
      "providers": {
        "gumloop": { "id": "backlinks" },
        "composio": { "id": "all_backlinks" }
      },
      "mcp_content": {
        "heading": "How to Retrieve Full Backlink Profiles for Analysis",
        "description": "The Ahrefs MCP provides your AI agents with comprehensive access to backlink data. AI agents can programmatically fetch and analyze all backlinks for a given domain or URL, crucial for competitive analysis and identifying link-building opportunities for your AI agent strategies."
      }
    },
    {
      "id": "broken_backlinks",
      "name": "Broken Backlinks",
      "description": "Get broken backlinks for a domain or URL",
      "providers": { "gumloop": { "id": "broken_backlinks" } },
      "mcp_content": {
        "heading": "Identify and Manage Broken Backlinks for SEO Health",
        "description": "Streamline SEO maintenance by enabling your AI agents to detect broken backlinks using Ahrefs data through the MCP. AI agents can proactively find link reclamation opportunities and help maintain a healthy link profile, an essential task for AI-driven SEO management."
      }
    },
    {
      "id": "refdomains",
      "name": "Referring Domains",
      "description": "Get referring domains for a domain or URL",
      "providers": { "gumloop": { "id": "refdomains" } },
      "mcp_content": {
        "heading": "Analyze Referring Domains for Link Building Intelligence",
        "description": "Equip your AI agents with the ability to dissect referring domains data from Ahrefs via the MCP. This allows AI agents to assess the quality and quantity of linking websites, a key factor in understanding and improving a site's authority for your AI agent initiatives."
      }
    },
    {
      "id": "anchors",
      "name": "Anchors",
      "description": "Retrieves anchor text data for a specified website or URL",
      "providers": {
        "gumloop": { "id": "anchors" },
        "composio": { "id": "anchor_data" }
      },
      "mcp_content": {
        "heading": "How Your AI Agent Can Decode Anchor Text Profiles",
        "description": "The Ahrefs MCP integration allows your AI agents to retrieve and analyze anchor text data. This insight helps AI agents understand how other sites are linking, optimize anchor text strategies, and ensure a natural, effective backlink profile, guided by your AI agent."
      }
    },
    {
      "id": "organic_keywords",
      "name": "Organic Keywords",
      "description": "Get organic keywords for a domain or URL",
      "providers": { "gumloop": { "id": "organic_keywords" } },
      "mcp_content": {
        "heading": "Discover a Website's Organic Keyword Rankings",
        "description": "Empower your AI agents to uncover the organic keywords a domain or URL ranks for, using Ahrefs data accessed via the MCP. This is fundamental for AI agents in competitor research, content gap analysis, and optimizing content for better search visibility."
      }
    },
    {
      "id": "organic_competitors",
      "name": "Organic Competitors",
      "description": "Retrieves a comprehensive overview of competitor data in relation to keyword rankings and organic search",
      "providers": {
        "gumloop": { "id": "organic_competitors" },
        "composio": { "id": "competitors_overview" }
      },
      "mcp_content": {
        "heading": "How to Identify and Analyze Organic Search Competitors",
        "description": "Leverage the Ahrefs MCP to enable your AI agents to automatically identify and analyze organic search competitors. This allows AI agents to understand the competitive landscape and refine SEO strategies to outperform rivals, enhancing your AI agent's strategic capabilities."
      }
    },
    {
      "id": "top_pages",
      "name": "Top Pages",
      "description": "Get top organic pages for a domain",
      "providers": { "gumloop": { "id": "top_pages" } },
      "mcp_content": {
        "heading": "Pinpoint a Domain's Top Performing Organic Pages",
        "description": "Through the Ahrefs MCP, your AI agents can identify the top organic pages of a domain. This helps AI agents understand what content resonates, drives traffic, and can inform AI-driven content strategies and internal linking optimizations."
      }
    },
    {
      "id": "paid_pages",
      "name": "Paid Pages",
      "description": "Get paid pages for a domain or URL",
      "providers": { "gumloop": { "id": "paid_pages" } },
      "mcp_content": {
        "heading": "Analyze Paid Search Performance and Competitor PPC Strategies",
        "description": "Integrate Ahrefs data via the MCP to allow your AI agents to investigate pages driving traffic through paid search. This provides AI agents with insights into competitor PPC strategies and can inform your own paid advertising efforts with AI agent assistance."
      }
    },
    {
      "id": "best_by_external_links",
      "name": "Best Pages by External Links",
      "description": "Get pages with the most external links",
      "providers": { "gumloop": { "id": "best_by_external_links" } },
      "mcp_content": {
        "heading": "Find a Site's Most Linked-To Content (By External Links)",
        "description": "Equip your AI agents to discover pages with the most external links (link equity) using Ahrefs via the MCP. This helps AI agents identify authoritative content, link-building targets, and understand what makes content link-worthy in your AI agent's analysis."
      }
    },
    {
      "id": "best_by_internal_links",
      "name": "Best Pages by Internal Links",
      "description": "Get pages with the most internal links",
      "providers": { "gumloop": { "id": "best_by_internal_links" } },
      "mcp_content": {
        "heading": "Optimize Site Structure: Analyze Internal Linking Patterns",
        "description": "Enable your AI agents to analyze pages with the most internal links using Ahrefs data through the MCP. This functionality helps AI agents understand site architecture and optimize internal linking for better SEO performance and link equity distribution."
      }
    },
    {
      "id": "linked_domains",
      "name": "Linked Domains",
      "description": "Get domains that are linked from the target",
      "providers": { "gumloop": { "id": "linked_domains" } },
      "mcp_content": {
        "heading": "Explore a Website's Outbound Link Network",
        "description": "Using the Ahrefs MCP, AI agents can identify domains linked *from* a target website or URL. This helps AI agents assess outbound link quality and understand a site's external linking neighborhood as part of your AI agent's comprehensive SEO audit."
      }
    },
    {
      "id": "outgoing_external_anchors",
      "name": "Outgoing External Anchors",
      "description": "Get external anchor texts used in outgoing links",
      "providers": { "gumloop": { "id": "outgoing_external_anchors" } },
      "mcp_content": {
        "heading": "How to Analyze External Outgoing Anchor Texts for Relevancy",
        "description": "The MCP allows your AI agents to examine the anchor texts used in outgoing external links from a target, using Ahrefs. This helps AI agents ensure that outbound links are relevant and use appropriate anchor text, maintaining the SEO integrity of the site."
      }
    },
    {
      "id": "outgoing_internal_anchors",
      "name": "Outgoing Internal Anchors",
      "description": "Get internal anchor texts used in outgoing links",
      "providers": { "gumloop": { "id": "outgoing_internal_anchors" } },
      "mcp_content": {
        "heading": "Refine Internal Linking: Analyze Outgoing Internal Anchors",
        "description": "Grant your AI agents the capability to analyze anchor texts of outgoing *internal* links using Ahrefs through the MCP. This is key for AI agents optimizing site navigation, user experience, and keyword targeting within the site's own content structure."
      }
    },
    {
      "id": "keywords_overview",
      "name": "Keywords Overview",
      "description": "Get metrics for keywords from Keywords Explorer",
      "providers": { "gumloop": { "id": "keywords_overview" } },
      "mcp_content": {
        "heading": "Get In-Depth Keyword Metrics (Volume, Difficulty, Clicks)",
        "description": "Access Ahrefs' Keywords Explorer metrics directly for your AI agents via the MCP. AI agents can retrieve search volume, keyword difficulty, clicks, and more, forming the bedrock of AI-driven keyword research and content strategy."
      }
    },
    {
      "id": "volume_history",
      "name": "Volume History",
      "description": "Get search volume history for a keyword",
      "providers": { "gumloop": { "id": "volume_history" } },
      "mcp_content": {
        "heading": "Track Historical Keyword Search Volume Trends",
        "description": "Enable your AI agents to chart the historical search volume for specific keywords using Ahrefs, integrated through the MCP. This allows AI agents to spot trends, seasonality, and anticipate shifts in searcher behavior for more effective AI agent planning."
      }
    },
    {
      "id": "volume_by_country",
      "name": "Volume by Country",
      "description": "Get search volume by country for a keyword",
      "providers": { "gumloop": { "id": "volume_by_country" } },
      "mcp_content": {
        "heading": "Analyze Keyword Search Volume by Country for Global SEO",
        "description": "Equip your AI agents with Ahrefs' keyword search volume data broken down by country, accessible via the MCP. This is invaluable for AI agents tailoring international SEO strategies and understanding geographic search demand."
      }
    },
    {
      "id": "matching_terms",
      "name": "Matching Terms",
      "description": "Get matching terms for keywords",
      "providers": { "gumloop": { "id": "matching_terms" } },
      "mcp_content": {
        "heading": "Expand Keyword Lists with Matching Term Variations",
        "description": "Leverage the Ahrefs MCP to empower your AI agents to find various keyword variations like phrase match, having same terms, etc. This helps AI agents in comprehensive keyword discovery and broadening content reach."
      }
    },
    {
      "id": "related_terms",
      "name": "Related Terms",
      "description": "Get related terms for keywords",
      "providers": { "gumloop": { "id": "related_terms" } },
      "mcp_content": {
        "heading": "Discover Semantically Related Keywords for Content Ideas",
        "description": "Through the Ahrefs MCP, AI agents can find terms that are semantically related to seed keywords. This feature aids AI agents in topic ideation, LSI keyword integration, and creating more comprehensive, contextually rich content."
      }
    },
    {
      "id": "search_suggestions",
      "name": "Search Suggestions",
      "description": "Retrieves search suggestions for a given keyword or phrase",
      "providers": {
        "gumloop": { "id": "search_suggestions" },
        "composio": { "id": "suggestions_explorer" }
      },
      "mcp_content": {
        "heading": "Uncover User Intent with Keyword Search Suggestions",
        "description": "Allow your AI agents to tap into Ahrefs' search suggestions (like Google Suggest) using the MCP. This helps AI agents understand what users are actively searching for, generate long-tail keywords, and create highly relevant content."
      }
    },
    {
      "id": "rank_tracker_overview",
      "name": "Rank Tracker Overview",
      "description": "Retrieves a comprehensive summary of keyword rankings and SEO performance",
      "providers": { "composio": { "id": "rank_tracker_overview" } },
      "mcp_content": {
        "heading": "Monitor Keyword Rankings and SEO Performance Over Time",
        "description": "Integrate Ahrefs Rank Tracker data via the MCP so your AI agents can get a comprehensive summary of keyword rankings. This enables AI agents to automate SEO performance monitoring and report on ranking progress."
      }
    },
    {
      "id": "serp_overview",
      "name": "SERP Overview",
      "description": "Retrieves a comprehensive overview of search engine results pages (SERP) data for specified keywords",
      "providers": { "composio": { "id": "serp_overview" } },
      "mcp_content": {
        "heading": "Analyze SERP Features and Competitive Dynamics",
        "description": "Provide your AI agents with Ahrefs' SERP overview data through the MCP. AI agents can analyze ranking URLs, SERP features (e.g., featured snippets), and understand the competitive landscape for target keywords to inform AI-driven optimization."
      }
    },
    {
      "id": "crawler_ip_ranges",
      "name": "Crawler IP Ranges",
      "description": "Retrieves the list of IP address ranges used by Ahrefs' web crawler (AhrefsBot)",
      "providers": { "composio": { "id": "crawler_ip_ranges" } },
      "mcp_content": {
        "heading": "Access AhrefsBot IP Ranges for Crawler Whitelisting",
        "description": "The Ahrefs MCP allows your AI agents to retrieve the list of IP address ranges used by Ahrefs' web crawler (AhrefsBot). This is a technical utility for AI agents managing server configurations or ensuring crawler access for site audits."
      }
    }
  ],
  "mcp_page_content": {
    "title": "How Can Your AI Agents Leverage the Ahrefs MCP Server?",
    "description": "The Ahrefs Model Context Protocol (MCP) server empowers your AI agents with direct access to Ahrefs' powerful SEO toolkit. Discover how your AI agents can automate complex SEO tasks, from in-depth backlink analysis and keyword research to competitor tracking and site audits. Below, explore the specific capabilities and how you can integrate them into your AI agent workflows via MCP for enhanced SEO automation and intelligence."
  }
}
